app/views/orders/new.html.erb

SELECT "items".* FROM "items"
---
    <script>
      $(document).ready(function () {
        $(".dropdown" ).select2({theme: "bootstrap"});
        $.widget.bridge('uibutton', $.ui.button);
        $('.datepicker').datepicker({format: 'yyyy/mm/dd'});
        $(".rem-row").click(function(){
        });

          $(".add-it").click(function(){
            if ($(".dropdown").find(":selected").val() !='') {
              var name = $(".dropdown").find(":selected").text();
              var id   = $(".dropdown").find(":selected").val();
              $(".orderForm").append($(".add-form").html());
              $(".orderForm").find(".form-group").last().children().find(".item-name").val(name);
              $(".orderForm").find(".form-group").last().children().find(".item-id").val(id)
            }else{
              prompt("Select Item First");
            };
          });

      });