app/views/orders/show.html.erb

        </h1>
        <h3>Total Amount: <%= @order.orders_items.sum(:total_price) %></h3>
---
SELECT "orders_items".* FROM "orders_items" WHERE "orders_items"."order_id" = $1  [["order_id", 6]]
SELECT SUM("orders_items"."total_price") FROM "orders_items" WHERE "orders_items"."order_id" = $1  [["order_id", 17]]