app/views/items/new.html.erb

SELECT "keywords"."name" FROM "keywords"
---
                  <label>Keywords</label>
                  <%= text_area_tag :keywords ,"", class: "form-control awesomeplete", rows: "3", placeholder: "Enter Keywords", "data-list" => Keyword.pluck(:name).join(",") %>