app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Press"], ["created_at", "2019-01-11 20:53:49.185929"], ["updated_at", "2019-01-11 20:53:49.185929"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save