app/controllers/items_controller.rb

  def create
    params[:item][:remaining_quantity] = params[:item][:quantity]
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "quantity", "description", "created_at", "updated_at", "remaining_quantity", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "quantity" = $1, "remaining_quantity" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["quantity", 200], ["remaining_quantity", 200], ["updated_at", "2019-06-23 08:42:44.121853"], ["id", 4]]

  def stock
    if params[:act].present? and params[:act] == "1"
      @item.quantity += params[:number].to_i
    else
      @item.quantity -= params[:number].to_i
    end
    @item.save
---
UPDATE "items" SET "quantity" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["quantity", 15], ["updated_at", "2019-06-23 08:28:11.834679"], ["id", 4]]