app/controllers/orders_controller.rb

  def index
    @orders = Order.all
    @members = Member.all
---
SELECT "orders".* FROM "orders"
SELECT "members".* FROM "members"

  def new
    @order = Order.new
    @items = Item.all
    @member = Member.all
---
SELECT "items".* FROM "items"
SELECT "members".* FROM "members"

  def create
    if params[:item_id].present? && params[:item_id].count != 0 && params["order"]["member_id"] != nil
      @order = Order.create(member_id: params["order"]["member_id"])
      params[:item_id].shift
      params[:item_id].count.times do |i|
        if params[:quantity][i].to_i != 0 && params[:price][i].to_i != 0
          OrdersItem.create(order_id: @order.id, item_id: params[:item_id][i].to_i, quantity: params[:quantity][i].to_i, unit_price: params[:price][i].to_i, total_price: params[:price][i].to_i*params[:quantity][i].to_i)
---
INSERT INTO "orders" ("member_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["member_id", 1], ["created_at", "2021-09-13 19:06:07.181697"], ["updated_at", "2021-09-13 19:06:07.181697"]]
INSERT INTO "orders_items" ("order_id", "item_id", "unit_price", "total_price", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["order_id", 14], ["item_id", 6], ["unit_price", 344], ["total_price", 4128], ["created_at", "2021-09-13 20:39:35.127404"], ["updated_at", "2021-09-13 20:39:35.127404"], ["quantity", 12]]

  def print
    @order = Order.find(params[:order_id])
    @items = @order.orders_items
    @printer = Escpos::Printer.new
    @printer << Escpos::Helpers.title("Modern Enterprises")
    @printer << Escpos::Helpers.text("Main Lalazar Road - Sarwar Chowk")
    @printer << Escpos::Helpers.text("0302-5639014")
    @printer << Escpos::Helpers.u("Item  Quantity  Price  Total")
    @items.each do |it|
      st = it.item.name+"  "+it.quantity.to_s+"  "+it.unit_price.to_s+"  "+it.total_price.to_s
      @printer << Escpos::Helpers.u(st)
    end
    @printer << Escpos::Helpers.b("Total: "+@order.orders_items.sum(:total_price).to_s)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "orders_items".* FROM "orders_items" WHERE "orders_items"."order_id" = $1  [["order_id", 17]]
SELECT SUM("orders_items"."total_price") FROM "orders_items" WHERE "orders_items"."order_id" = $1  [["order_id", 17]]